# @Version  : 1.0
# @Author   : 韩顺平


# 编写一个程序, 可以打印10句 "你好，韩顺平教育!"。请大家想想怎么做?

# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")
# print("你好，韩顺平教育!")

# 定义一个列表(后面老师会具体的介绍), 可以视为一个数据集
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(nums, type(nums))
# for <变量> in <范围/序列>:
#     <循环操作语句>
# 每次循环的时候, 依次将nums中的值取出赋给i
for i in nums:
    print("你好，韩顺平教育!", i)
# for i in [1, 2, 3, 4]:
#     print("你好，韩顺平教育!", i)
