# @Version  : 1.0
# @Author   : 韩顺平

# 演示算术运算符的使用

# /, //, % **

# 对于除号 /, 返回结果是小数
print(10 / 3)

# 对于取整除 // , 返回商的整数部分(并且是向下取整)
print(10 // 3)  # 3
print(-9 // 2)  # -5
print(-10 // 3)  # -4

# 当对一个数取模时, 对应的运算公式:  a % b = a - a // b * b
print(10 % 3)  # 1
# 分析  -10 % 3 = -10 - (-10) // 3 * 3 = -10 - (-4) * 3 = -10 +12 = 2
print(-10 % 3)  # 2
# 分析 10 % -3 = 10 - 10 // (-3) * (-3) = 10 - (-4) * (-3) = 10 - 12=-2
print(10 % -3)  # -2
# 分析 -10 % -3 = -10 +9 = -1
print(-10 % -3)  # -1

print(2 ** 5)  # 32
print(9 ** 2)  # 81
